openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/src/ch32v205_rcc.c
  tmpreg = RCC->CFGR0;

  tmpreg &= CFGR0_PLL_Mask;
  tmpreg |= RCC_PLLSource | RCC_PLLMul;
  RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_PLLCmd
 *
 * @brief   Enables or disables the PLL.
 *          Note-The PLL can not be disabled if it is used as system clock.
 *          
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_PLLCmd(FunctionalState NewState)
{
	if(NewState)
	{
		RCC->CTLR |= (1<<24);
	}
	else
	{
		RCC->CTLR &= ~(1<<24);		
	}
}

/*********************************************************************
 * @fn      RCC_SYSCLKConfig
 *
 * @brief   Configures the system clock (SYSCLK).
 *
 * @param   RCC_SYSCLKSource - specifies the clock source used as system clock.
 *            RCC_SYSCLKSource_HSI - HSI selected as system clock.
 *            RCC_SYSCLKSource_HSE - HSE selected as system clock.
 *            RCC_SYSCLKSource_PLLCLK - PLL selected as system clock.
 *
 * @return  none
 */
void RCC_SYSCLKConfig(uint32_t RCC_SYSCLKSource)
{
  uint32_t tmpreg = 0;

  tmpreg = RCC->CFGR0;
  tmpreg &= CFGR0_SW_Mask;
  tmpreg |= RCC_SYSCLKSource;
  RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_GetSYSCLKSource
 *
 * @brief   Returns the clock source used as system clock.
 *
 * @return  0x00 - HSI used as system clock.
 *          0x04 - HSE used as system clock.
 *          0x08 - PLL used as system clock.
 */
uint8_t RCC_GetSYSCLKSource(void)
{
  return ((uint8_t)(RCC->CFGR0 & CFGR0_SWS_Mask));
}

/*********************************************************************
 * @fn      RCC_HCLKConfig
 *
 * @brief   Configures the HB clock (HCLK).
 *
 * @param   RCC_SYSCLK - defines the HB clock divider. This clock is derived from
 *        the system clock (SYSCLK).
 *            RCC_SYSCLK_Div1 - HB clock = SYSCLK.
 *            RCC_SYSCLK_Div2 - HB clock = SYSCLK/2.
 *            RCC_SYSCLK_Div4 - HB clock = SYSCLK/4.
 *            RCC_SYSCLK_Div8 - HB clock = SYSCLK/8.
 *            RCC_SYSCLK_Div16 - HB clock = SYSCLK/16.
 *            RCC_SYSCLK_Div64 - HB clock = SYSCLK/64.
 *            RCC_SYSCLK_Div128 - HB clock = SYSCLK/128.
 *            RCC_SYSCLK_Div256 - HB clock = SYSCLK/256.
 *            RCC_SYSCLK_Div512 - HB clock = SYSCLK/512.
 *
 * @return  none
 */
void RCC_HCLKConfig(uint32_t RCC_SYSCLK)
{
  uint32_t tmpreg = 0;

  tmpreg = RCC->CFGR0;
  tmpreg &= CFGR0_HPRE_Reset_Mask;
  tmpreg |= RCC_SYSCLK;
  RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_PCLK1Config
 *
 * @brief   Configures the Low Speed PB clock (PCLK1).
 *
 * @param   RCC_HCLK - defines the PB1 clock divider. This clock is derived from
 *        the HB clock (HCLK).
 *            RCC_HCLK_Div1 - PB1 clock = HCLK.
 *            RCC_HCLK_Div2 - PB1 clock = HCLK/2.
 *            RCC_HCLK_Div4 - PB1 clock = HCLK/4.
 *            RCC_HCLK_Div8 - PB1 clock = HCLK/8.
 *            RCC_HCLK_Div16 - PB1 clock = HCLK/16.
 *
 * @return  none
 */
void RCC_PCLK1Config(uint32_t RCC_HCLK)
{
  uint32_t tmpreg = 0;

  tmpreg = RCC->CFGR0;
  tmpreg &= CFGR0_PPRE1_Reset_Mask;
  tmpreg |= RCC_HCLK;
  RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_PCLK2Config
 *
 * @brief   Configures the High Speed PB clock (PCLK2).
 *
 * @param   RCC_HCLK - defines the PB2 clock divider. This clock is derived from
 *        the HB clock (HCLK).
 *            RCC_HCLK_Div1 - PB2 clock = HCLK.
 *            RCC_HCLK_Div2 - PB2 clock = HCLK/2.
 *            RCC_HCLK_Div4 - PB2 clock = HCLK/4.
 *            RCC_HCLK_Div8 - PB2 clock = HCLK/8.
 *            RCC_HCLK_Div16 - PB2 clock = HCLK/16.
 *
 * @return  none
 */
void RCC_PCLK2Config(uint32_t RCC_HCLK)
{
  uint32_t tmpreg = 0;

  tmpreg = RCC->CFGR0;
  tmpreg &= CFGR0_PPRE2_Reset_Mask;
  tmpreg |= RCC_HCLK << 3;
  RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_ITConfig
 *
 * @brief   Enables or disables the specified RCC interrupts.
 *
 * @param   RCC_IT - specifies the RCC interrupt sources to be enabled or disabled.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_LSERDY - LSE ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_PLLRDY - PLL ready interrupt.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_ITConfig(uint8_t RCC_IT, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    *(__IO uint8_t *) INTR_BYTE2_ADDRESS |= RCC_IT;
  }
  else
  {
    *(__IO uint8_t *) INTR_BYTE2_ADDRESS &= (uint8_t)~RCC_IT;
  }
}

/*********************************************************************
 * @fn      RCC_USBCLKConfig
 *
 * @brief   Configures the USB clock (USBCLK).
 *
 * @param    RCC_USBCLKSource: specifies the USB clock source. This clock is
 *        derived from the PLL output.
 *             RCC_USBCLKSource_PLLCLK_Div1 - PLL clock selected as USB clock source(48Mhz).
 *             RCC_USBCLKSource_PLLCLK_Div2 - PLL clock selected as USB clock source(96MHz).
 *             RCC_USBCLKSource_PLLCLK_Div3 - PLL clock selected as USB clock source(144MHz).
 *             RCC_USBCLKSource_PLLCLK_Div4 - PLL clock selected as USB clock source(192MHz).
 *             RCC_USBCLKSource_PLLCLK_Div1_5 - PLL clock selected as USB clock source(72MHz).
 *             RCC_USBCLKSource_PLLCLK_Div2_5 - PLL clock selected as USB clock source(120MHz).
 *             RCC_USBCLKSource_PLLCLK_Div3_5 - PLL clock selected as USB clock source(168MHz).
 *
 * @return  none
 */
void RCC_USBCLKConfig(uint32_t RCC_USBCLKSource)
{
    RCC->CFGR0 &= ~((uint32_t)(7 << 28));
    RCC->CFGR0 |= RCC_USBCLKSource;
}

/*********************************************************************
 * @fn      RCC_ADCCLKConfig
 *
 * @brief   Configures the ADC clock (ADCCLK).
 *
 * @param   ADC_CLK_S - defines the ADC clock.
 *          RCC_PCLK2_Div2 - ADC clock = PCLK2/2.
 *          RCC_PCLK2_Div4 - ADC clock = PCLK2/4.
 *          RCC_PCLK2_Div6 - ADC clock = PCLK2/6.
 *          RCC_PCLK2_Div8 - ADC clock = PCLK2/8.
 *          RCC_HCLK_ADC - ADC clock = HCLK.
 *          RCC_ADC_USBHS_Div5 - ADC clock = USBHSCLK/5.
 *          RCC_ADC_USBHS_Div6 - ADC clock = USBHSCLK/6.
 *
 * @return  none
 */
void RCC_ADCCLKConfig(uint32_t ADC_CLK_S)
{
  uint32_t tmpreg = 0;

  tmpreg = RCC->CFGR2;
  tmpreg &= ~(3 << 21);

  if(ADC_CLK_S & (3 << 21))
  {
    tmpreg |= ADC_CLK_S;
    RCC->CFGR2 = tmpreg;
  }
  else
  {
    tmpreg = RCC->CFGR0;
    tmpreg &= CFGR0_ADCPRE_Reset_Mask;
    tmpreg |= ADC_CLK_S;
    RCC->CFGR0 = tmpreg;
  }
}

/*********************************************************************
 * @fn      RCC_LSEConfig
 *
 * @brief   Configures the External Low Speed oscillator (LSE).
 *
 * @param   RCC_LSE - specifies the new state of the LSE.
 *            RCC_LSE_OFF - LSE oscillator OFF.
 *            RCC_LSE_ON - LSE oscillator ON.
 *            RCC_LSE_Bypass - LSE oscillator bypassed with external clock.
 *
 * @return  none
 */
void RCC_LSEConfig(uint8_t RCC_LSE)
{
  *(__IO uint8_t *) BDCTLR_ADDRESS = RCC_LSE_OFF;
  *(__IO uint8_t *) BDCTLR_ADDRESS = RCC_LSE_OFF;
	
  switch(RCC_LSE)
  {
    case RCC_LSE_ON:
      *(__IO uint8_t *) BDCTLR_ADDRESS = RCC_LSE_ON;
      break;
      
    case RCC_LSE_Bypass:
      *(__IO uint8_t *) BDCTLR_ADDRESS = RCC_LSE_Bypass | RCC_LSE_ON;
      break;            
      
    default:
      break;      
  }
}

/*********************************************************************
 * @fn      RCC_LSICmd
 *
 * @brief   Enables or disables the Internal Low Speed oscillator (LSI).
 *          Note-
 *          LSI can not be disabled if the IWDG is running.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_LSICmd(FunctionalState NewState)
{
	if(NewState)
	{
		RCC->RSTSCKR |= (1<<0);
	}
	else
  {
		RCC->RSTSCKR &= ~(1<<0);		
	}	
}

/*********************************************************************
 * @fn      RCC_RTCCLKConfig
 *
 * @brief   Once the RTC clock is selected it can't be changed unless the Backup domain is reset.
 *
 * @param   RCC_RTCCLKSource - specifies the RTC clock source.
 *            RCC_RTCCLKSource_LSE - LSE selected as RTC clock.
 *            RCC_RTCCLKSource_LSI - LSI selected as RTC clock.
 *            RCC_RTCCLKSource_HSE_Div128 - HSE clock divided by 128 selected as RTC clock.
 *          Note-
 *           Once the RTC clock is selected it can't be changed unless the Backup domain is reset.
 *
 * @return  none
 */
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource)
{
  RCC->BDCTLR |= RCC_RTCCLKSource;
}

/*********************************************************************
 * @fn      RCC_RTCCLKCmd
 *
 * @brief   This function must be used only after the RTC clock was selected
 *        using the RCC_RTCCLKConfig function.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_RTCCLKCmd(FunctionalState NewState)
{
	if(NewState)
	{
		RCC->BDCTLR |= (1<<15);
	}
	else
	{
		RCC->BDCTLR &= ~(1<<15);		
	}	
}

/*********************************************************************
 * @fn      RCC_GetClocksFreq
 *
 * @brief   The result of this function could be not correct when using
 *        fractional value for HSE crystal.
 *
 * @param   RCC_Clocks - pointer to a RCC_ClocksTypeDef structure which will hold
 *        the clocks frequencies.
 *
 * @return  none
 */
void RCC_GetClocksFreq(RCC_ClocksTypeDef* RCC_Clocks)
{
    uint32_t tmp = 0, pllmull = 0, pllsource = 0, presc = 0, tmp1 = 0;

