openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/src/ch32v205_rcc.c
    tmp = RCC->CFGR0 & CFGR0_SWS_Mask;

    switch (tmp)
    {
      case 0x00:
        if(RCC->CTLR & (1<<2))
        {
          RCC_Clocks->SYSCLK_Frequency = HSI_LP_VALUE;
        }
        else
        {
          RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
        }
        break;

      case 0x04:
        RCC_Clocks->SYSCLK_Frequency = HSE_VALUE;
        break;

      case 0x08:
        pllmull = RCC->CFGR0 & CFGR0_PLLMull_Mask;
        pllsource = RCC->CFGR0 & CFGR0_PLLSRC_Mask;

        pllmull = ( pllmull >> 18) + 2;

        if (pllsource == 0x00)
        {
          if(EXTEN->CTLR0 & EXTEN_PLL_HSI_PRE){
              RCC_Clocks->SYSCLK_Frequency = (HSI_VALUE) * pllmull;
          }
          else{
              RCC_Clocks->SYSCLK_Frequency = (HSI_VALUE >> 1) * pllmull;
          }
        }
        else
        {
          if ((RCC->CFGR0 & CFGR0_PLLXTPRE_Mask) != (uint32_t)RESET)
          {
            RCC_Clocks->SYSCLK_Frequency = (HSE_VALUE >> 1) * pllmull;
          }
          else
          {
            RCC_Clocks->SYSCLK_Frequency = HSE_VALUE * pllmull;
          }
        }

        break;

      default:
        RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
        break;
    }

    tmp = RCC->CFGR0 & CFGR0_HPRE_Set_Mask;
    tmp = tmp >> 4;
    presc = HBPrescTable[tmp];
    RCC_Clocks->HCLK_Frequency = RCC_Clocks->SYSCLK_Frequency >> presc;
    tmp = RCC->CFGR0 & CFGR0_PPRE1_Set_Mask;
    tmp = tmp >> 8;
    presc = PBPrescTable[tmp];
    RCC_Clocks->PCLK1_Frequency = RCC_Clocks->HCLK_Frequency >> presc;
    tmp = RCC->CFGR0 & CFGR0_PPRE2_Set_Mask;
    tmp = tmp >> 11;
    presc = PBPrescTable[tmp];
    RCC_Clocks->PCLK2_Frequency = RCC_Clocks->HCLK_Frequency >> presc;

    tmp1 = (RCC->CFGR2 & (3 << 21)) >> 21;

    if(tmp1 == 0x01)
    {
      RCC_Clocks->ADCCLK_Frequency = RCC_Clocks->HCLK_Frequency;
    }
    else if(tmp1 == 0x00)
    {
      tmp = RCC->CFGR0 & CFGR0_ADCPRE_Set_Mask;
      tmp = tmp >> 14;
      presc = ADCPrescTable[tmp];
      RCC_Clocks->ADCCLK_Frequency = RCC_Clocks->PCLK2_Frequency / presc;
    }
    else if(tmp1 == 0x02)
    {
      RCC_Clocks->ADCCLK_Frequency = 96000000;
    }
    else if(tmp1 == 0x03)
    {
      RCC_Clocks->ADCCLK_Frequency = 80000000;
    }
}

/*********************************************************************
 * @fn      RCC_HBPeriphClockCmd
 *
 * @brief   Enables or disables the HB peripheral clock.
 *
 * @param   RCC_HBPeriph - specifies the HB peripheral to gates its clock.
 *            RCC_HBPeriph_DMA1.
 *            RCC_HBPeriph_DMA2.
 *            RCC_HBPeriph_SRAM.
 *            RCC_HBPeriph_CRC.
 *            RCC_HBPeriph_QSPI1.
 *            RCC_HBPeriph_PIOC.
 *            RCC_HBPeriph_FSMC.
 *            RCC_HBPeriph_USBHS. 
 *            RCC_HBPeriph_USBFS.
 *            RCC_HBPeriph_USBPD.
 *          Note-
 *            SRAM clock can be disabled only during sleep mode.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HBPeriphClockCmd(uint32_t RCC_HBPeriph, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->HBPCENR |= RCC_HBPeriph;
  }
  else
  {
    RCC->HBPCENR &= ~RCC_HBPeriph;
  }
}

/*********************************************************************
 * @fn      RCC_PB2PeriphClockCmd
 *
 * @brief   Enables or disables the High Speed PB (PB2) peripheral clock.
 *
 * @param   RCC_PB2Periph - specifies the PB2 peripheral to gates its clock.
 *            RCC_PB2Periph_AFIO.
 *            RCC_PB2Periph_GPIOA.
 *            RCC_PB2Periph_GPIOB.
 *            RCC_PB2Periph_GPIOC.
 *            RCC_PB2Periph_GPIOD.
 *            RCC_PB2Periph_GPIOE.
 *            RCC_PB2Periph_ADC1.
 *            RCC_PB2Periph_TIM1.
 *            RCC_PB2Periph_SPI1.
 *            RCC_PB2Periph_USART1.
 *          NewState - ENABLE or DISABLE
 *
 * @return  none
 */
void RCC_PB2PeriphClockCmd(uint32_t RCC_PB2Periph, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->PB2PCENR |= RCC_PB2Periph;
  }
  else
  {
    RCC->PB2PCENR &= ~RCC_PB2Periph;
  }
}

/*********************************************************************
 * @fn      RCC_PB1PeriphClockCmd
 *
 * @brief   Enables or disables the Low Speed PB (PB1) peripheral clock.
 *
 * @param   RCC_PB1Periph - specifies the PB1 peripheral to gates its clock.
 *            RCC_PB1Periph_TIM2.
 *            RCC_PB1Periph_TIM3.
 *            RCC_PB1Periph_TIM4.
 *            RCC_PB1Periph_WWDG.
 *            RCC_PB1Periph_SPI2.
 *            RCC_PB1Periph_USART2.
 *            RCC_PB1Periph_USART3.
 *            RCC_PB1Periph_USART4
 *            RCC_PB1Periph_USART5
 *            RCC_PB1Periph_USART6
 *            RCC_PB1Periph_USART7
 *            RCC_PB1Periph_USART8
 *            RCC_PB1Periph_I2C1.
 *            RCC_PB1Periph_I2C2.
 *            RCC_PB1Periph_CAN1.
 *            RCC_PB1Periph_BKP.
 *            RCC_PB1Periph_PWR.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_PB1PeriphClockCmd(uint32_t RCC_PB1Periph, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->PB1PCENR |= RCC_PB1Periph;
  }
  else
  {
    RCC->PB1PCENR &= ~RCC_PB1Periph;
  }
}

/*********************************************************************
 * @fn      RCC_PB2PeriphResetCmd
 *
 * @brief   Forces or releases High Speed PB (PB2) peripheral reset.
 *
 * @param   RCC_PB2Periph - specifies the PB2 peripheral to reset.
 *            RCC_PB2Periph_AFIO.
 *            RCC_PB2Periph_GPIOA.
 *            RCC_PB2Periph_GPIOB.
 *            RCC_PB2Periph_GPIOC.
 *            RCC_PB2Periph_GPIOD.
 *            RCC_PB2Periph_GPIOE.
 *            RCC_PB2Periph_ADC1.
 *            RCC_PB2Periph_TIM1.
 *            RCC_PB2Periph_SPI1.
 *            RCC_PB2Periph_TIM8
 *            RCC_PB2Periph_USART1.
 *          NewState - ENABLE or DISABLE
 *
 * @return  none
 */
void RCC_PB2PeriphResetCmd(uint32_t RCC_PB2Periph, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->PB2PRSTR |= RCC_PB2Periph;
  }
  else
  {
    RCC->PB2PRSTR &= ~RCC_PB2Periph;
  }
}

/*********************************************************************
 * @fn      RCC_PB1PeriphResetCmd
 *
 * @brief   Forces or releases Low Speed PB (PB1) peripheral reset.
 *
 * @param   RCC_PB1Periph - specifies the PB1 peripheral to reset.
 *            RCC_PB1Periph_TIM2.
 *            RCC_PB1Periph_TIM3.
 *            RCC_PB1Periph_TIM4.
 *            RCC_PB1Periph_WWDG.
 *            RCC_PB1Periph_SPI2.
 *            RCC_PB1Periph_USART2.
 *            RCC_PB1Periph_USART3.
 *            RCC_PB1Periph_USART4
 *            RCC_PB1Periph_USART5
 *            RCC_PB1Periph_USART6
 *            RCC_PB1Periph_USART7
 *            RCC_PB1Periph_USART8
 *            RCC_PB1Periph_I2C1.
 *            RCC_PB1Periph_I2C2.
 *            RCC_PB1Periph_CAN1.
 *            RCC_PB1Periph_BKP.
 *            RCC_PB1Periph_PWR.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_PB1PeriphResetCmd(uint32_t RCC_PB1Periph, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->PB1PRSTR |= RCC_PB1Periph;
  }
  else
  {
    RCC->PB1PRSTR &= ~RCC_PB1Periph;
  }
}

/*********************************************************************
 * @fn      RCC_HBPeriphResetCmd
 *
 * @brief   Forces or releases High Speed HB (HB) peripheral reset.
 *
 * @param   RCC_HBPeriph - specifies the HB peripheral to reset.
 *            RCC_HBPeriph_QSPI1.
 *            RCC_HBPeriph_PIOC.
 *            RCC_HBPeriph_FSMC.
 *            RCC_HBPeriph_USBFS.
 *            RCC_HBPeriph_USBPD.
 *          NewState - ENABLE or DISABLE
 *
 * @return  none
 */
void RCC_HBPeriphResetCmd(uint32_t RCC_HBPeriph, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->HBRSTR |= RCC_HBPeriph;
  }
  else
  {
    RCC->HBRSTR &= ~RCC_HBPeriph;
  }
}

/*********************************************************************
 * @fn      RCC_BackupResetCmd
 *
 * @brief   Forces or releases the Backup domain reset.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_BackupResetCmd(FunctionalState NewState)
{
	if(NewState)
	{
		RCC->BDCTLR |= (1<<16);
	}
	else
  {
		RCC->BDCTLR &= ~(1<<16);		
	}		
}

