openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/src/ch32v205_rcc.c
/*******************************************************************************
* Function Name  : RCC_ClockSecuritySystemCmd
* Description    : Enables or disables the Clock Security System.
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/	
void RCC_ClockSecuritySystemCmd(FunctionalState NewState)
{
	if(NewState)
	{
		RCC->CTLR |= (1<<19);
	}
	else
  {
		RCC->CTLR &= ~(1<<19);		
	}		
}

/*********************************************************************
 * @fn      RCC_MCOConfig
 *
 * @brief   Selects the clock source to output on MCO pin.
 *
 * @param   RCC_MCO - specifies the clock source to output.
 *            RCC_MCO_NoClock - No clock selected.
 *            RCC_MCO_SYSCLK - System clock selected.
 *            RCC_MCO_HSI - HSI oscillator clock selected.
 *            RCC_MCO_HSE - HSE oscillator clock selected.
 *            RCC_MCO_PLLCLK_Div2 - PLL clock divided by 2 selected.
 *
 * @return  none
 */
void RCC_MCOConfig(uint8_t RCC_MCO)
{
  RCC->CFGR0 |= RCC_MCO<<24;
}

/*********************************************************************
 * @fn      RCC_GetFlagStatus
 *
 * @brief   Checks whether the specified RCC flag is set or not.
 *
 * @param   RCC_FLAG - specifies the flag to check.
 *            RCC_FLAG_HSIRDY - HSI oscillator clock ready.
 *            RCC_FLAG_HSERDY - HSE oscillator clock ready.
 *            RCC_FLAG_USBHSPLLRDY - USBHS PLL clock ready.
 *            RCC_FLAG_PLLRDY - PLL clock ready.
 *            RCC_FLAG_LSERDY - LSE oscillator clock ready.
 *            RCC_FLAG_LSIRDY - LSI oscillator clock ready.
 *            RCC_FLAG_PINRST - Pin reset.
 *            RCC_FLAG_PORRST - POR/PDR reset.
 *            RCC_FLAG_SFTRST - Software reset.
 *            RCC_FLAG_IWDGRST - Independent Watchdog reset.
 *            RCC_FLAG_WWDGRST - Window Watchdog reset.
 *            RCC_FLAG_LPWRRST - Low Power reset.
 *
 * @return  FlagStatus - SET or RESET.
 */
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG)
{
  uint32_t tmp = 0;
  uint32_t statusreg = 0;
	
  FlagStatus bitstatus = RESET;
  tmp = RCC_FLAG >> 5;
	
  if (tmp == 1)            
  {
    statusreg = RCC->CTLR;
  }
  else if (tmp == 2)       
  {
    statusreg = RCC->BDCTLR;
  }
  else                    
  {
    statusreg = RCC->RSTSCKR;
  }

  tmp = RCC_FLAG & FLAG_Mask;
	
  if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/*********************************************************************
 * @fn      RCC_ClearFlag
 *
 * @brief   Clears the RCC reset flags.
 *          Note-   
 *            The reset flags are: RCC_FLAG_PINRST, RCC_FLAG_PORRST, RCC_FLAG_SFTRST,
 *          RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST, RCC_FLAG_LPWRRST
 *
 * @return  none
 */
void RCC_ClearFlag(void)
{
  RCC->RSTSCKR |= RSTSCKR_RMVF_Set;
}

/*********************************************************************
 * @fn      RCC_GetITStatus
 *
 * @brief   Checks whether the specified RCC interrupt has occurred or not.
 *
 * @param   RCC_IT - specifies the RCC interrupt source to check.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_LSERDY - LSE ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_PLLRDY - PLL ready interrupt.
 *            RCC_IT_CSS - Clock Security System interrupt.
 *
 * @return  ITStatus - SET or RESET.
 */
ITStatus RCC_GetITStatus(uint8_t RCC_IT)
{
  ITStatus bitstatus = RESET;

  if ((RCC->INTR & RCC_IT) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return  bitstatus;
}

/*********************************************************************
 * @fn      RCC_ClearITPendingBit
 *
 * @brief   Clears the RCC's interrupt pending bits.
 *
 * @param   RCC_IT - specifies the interrupt pending bit to clear.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_LSERDY - LSE ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_PLLRDY - PLL ready interrupt.
 *            RCC_IT_CSS - Clock Security System interrupt.
 *
 * @return  none
 */
void RCC_ClearITPendingBit(uint8_t RCC_IT)
{
  *(__IO uint8_t *) INTR_BYTE3_ADDRESS = RCC_IT;
}

/*********************************************************************
 * @fn      RCC_HSE_LP_Cmd
 *
 * @brief   Enables or disables  low power mode of the External High Speed
 *        oscillator (HSE).
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HSE_LP_Cmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= (1<<20);
    }
    else
    {
        RCC->CTLR &= ~(1<<20);
    }
}

/*********************************************************************
 * @fn      RCC_HSI_LP_Cmd
 *
 * @brief   Enables or disables  low power mode of the Internal High Speed
 *        oscillator (HSI) .
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HSI_LP_Cmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= (1<<2);
    }
    else
    {
        RCC->CTLR &= ~(1<<2);
    }
}

/*********************************************************************
 * @fn      RCC_USBHS_PLLCmd
 *
 * @brief   ENABLE or DISABLE USBHS PLL Clock.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_USBHS_PLLCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= (1 << 22);
    }
    else
    {
        RCC->CTLR &= ~(1 << 22);
    }
}

/*********************************************************************
 * @fn      RCC_ADCCLKDutyCycleConfig
 *
 * @brief   Configures the ADC clock high level duty cycle.
 *
 * @param   RCC_DutyCycle - high level duty cycle.
 *            RCC_ADC_H_Level_Mode0 - ADC clock high-level duty cycle is mode 0.
 *            RCC_ADC_H_Level_Mode1 - ADC clock high-level duty cycle is mode 1.
 *
 * @return  none
 */
void RCC_ADCCLKDutyCycleConfig(uint32_t RCC_DutyCycle)
{
    RCC->CFGR2 &= ~(1 << 23);
    RCC->CFGR2 |= RCC_DutyCycle;
}

/*********************************************************************
 * @fn      RCC_USBHSPLLClockSourceDivConfig
 *
 * @brief   Configures the USBHS PLL source clock division.
 *
 * @param   RCC_USBHSPLL_IN_Div - the USBHS PLL source clock division.
 *            RCC_USBHSPLL_IN_Divx - x can select(1~8)
 *
 * @return  none
 */
void RCC_USBHSPLLClockSourceDivConfig(uint32_t RCC_USBHSPLL_IN_Div)
{
    RCC->CFGR2 &= ~(7 << 24);
    RCC->CFGR2 |= RCC_USBHSPLL_IN_Div;
}

/*********************************************************************
 * @fn      RCC_USBSSPLLReferConfig
 *
 * @brief   Configures the USBHS PLL refer clock.
 *
 * @param   RCC_USBHSPLLRefer - the USBSS PLL refer clock.
 *            RCC_USBHSPLLRefer_5M - USBSS PLL Refer clock 5M
 *            RCC_USBHSPLLRefer_8M - USBSS PLL Refer clock 8M
 *            RCC_USBHSPLLRefer_20M - USBSS PLL Refer clock 20M
 *            RCC_USBHSPLLRefer_24M - USBSS PLL Refer clock 24M
 *
 * @return  none
 */
void RCC_USBHSPLLReferConfig(uint32_t RCC_USBHSPLLRefer)
{
    RCC->CFGR2 &= ~(3 << 28);
    RCC->CFGR2 |= RCC_USBHSPLLRefer;
}

/*********************************************************************
 * @fn      RCC_USBHSPLLCLKConfig
 *
 * @brief   Configures the USBHS PLL clock source.
 *
 * @param   RCC_USBHSPLLSource - the USBHS clock source.
 *            RCC_USBHSPLLSource_HSE - HSE clock selected as USBHS PLL clock entry
 *            RCC_USBHSPLLSource_HSI - HSI clock selected as USBHS PLL clock entry
 *
 * @return  none
 */
void RCC_USBHSPLLCLKConfig(uint32_t RCC_USBHSPLLSource)
{
    RCC->CFGR2 &= ~(1 << 27);
    RCC->CFGR2 |= RCC_USBHSPLLSource;
}

/*********************************************************************
 * @fn      RCC_USBFSCLKConfig
 *
 * @brief   Configures the USBFS clock source.
 *
 * @param   RCC_USBFSCLKSource - specifies the RNG clock source.
 *            RCC_USBFSCLKSource_USBHSPLL - USBHS PLL clock selected as USBFS_48M clock entry
 *            RCC_USBFSCLKSource_PLL - PLL clock selected as USBFS_48M clock entry
 *
 * @return  none
 */
void RCC_USBFSCLKConfig(uint32_t RCC_USBFSCLKSource)
{
    RCC->CFGR2 &= ~(1 << 31);
    RCC->CFGR2 |= RCC_USBFSCLKSource;
}
